; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob54) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 distributor0)
	(clear crate1)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 484)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 250)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 32)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 23)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 89)
	(at crate3 depot0)
	(on crate3 crate2)
	(= (weight crate3) 15)
	(at crate4 distributor1)
	(on crate4 crate0)
	(= (weight crate4) 11)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate3 crate0)
		(on crate4 pallet1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 5
2. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 23
   goals met: 1 of 5
3. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 5
4. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 5
5. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 23 to 38
   goals met: 1 of 5
6. (lift hoist2 crate4 crate0 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate0)
   added: (lifting hoist2 crate4) (clear crate0)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 5
7. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 5
8. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 38 to 49
   goals met: 1 of 5
9. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 49 to 34
   goals met: 1 of 5
10. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 5
11. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 34 to 23
   goals met: 1 of 5
12. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 5
13. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 pallet1)
   goals met: 2 of 5
14. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 23 to 38
   goals met: 2 of 5
15. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 43 to 44
   goals met: 2 of 5
16. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 38 to 70
   goals met: 2 of 5
17. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 44 to 54
   goals met: 2 of 5
18. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 70 to 38
   goals met: 2 of 5
19. (drop hoist0 crate0 crate2 depot0)
   deleted: (lifting hoist0 crate0) (clear crate2)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate2)
   goals met: 3 of 5
20. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 38 to 23
   goals met: 3 of 5
21. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 54 to 64
   goals met: 3 of 5
22. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 23 to 0
   goals met: 3 of 5
23. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 4 of 5
24. (drop hoist0 crate3 crate0 depot0)
   deleted: (lifting hoist0 crate3) (clear crate0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate0)
   goals met: 5 of 5
